{
    "VI_instructions":[
    ["In the image <image> provided, can you identify any apparent defects such as {subfolder_string} on this {product}?"],
    ["Regarding the image <image>, does this {product} exhibit any noticeable issues, for example, {subfolder_string}?"],
    ["Looking at the image <image>, are there discernible problems like {subfolder_string} present on the {product}?"],
    ["Upon examining the image <image>, are defects such as {subfolder_string} visible on this {product}?"],
    ["Can any {subfolder_string}-type anomalies be spotted on the {product} in the image <image>?"],
    ["In this image <image>, do you see any faults, specifically like {subfolder_string}, on the {product}?"],
    ["Are imperfections, particularly {subfolder_string}, observable on the {product} in the image <image>?"],
    ["Does the image <image> reveal any {subfolder_string} or similar flaws on the {product}?"],
    ["Upon inspecting the image <image>, are there any {subfolder_string} defects noticeable on the {product}?"],
    ["Can one notice any {subfolder_string}-like issues in the {product} as depicted in the image <image>?"],
    ["Is there any evidence of {subfolder_string} or related faults on the {product} in the image <image>?"],
    ["Does this {product}, as shown in the image <image>, have any visible anomalies, particularly {subfolder_string}?"],
    ["Can you point out any visible {subfolder_string} faults in the {product} in the provided image <image>?"],
    ["Are there signs of {subfolder_string} or similar problems on the {product} shown in the image <image>?"],
    ["Regarding the image <image> of the {product}, are there any noticeable {subfolder_string}-type faults?"],
    ["In the image <image>, do you detect any faults such as {subfolder_string} on this {product}?"],
    ["Does the {product} in the image <image> exhibit any {subfolder_string} or comparable defects?"],
    ["Looking at this {product} in the image <image>, are faults like {subfolder_string} visible?"],
    ["Can any faults, particularly of the {subfolder_string} variety, be seen on the {product} in the image <image>?"],
    ["In the image <image> shown, are there any detectable {subfolder_string}-like flaws on the {product}?"],
    ["Is there any evidence of structural weaknesses or visible damages such as {subfolder_string} in the {product}, as can be clearly seen in the attached image <image>?"],
    ["Could you please confirm if there are any noticeable issues like {subfolder_string} on this particular {product}, as depicted in the provided image <image>?"],
    ["In the image <image> of the {product}, are there any visible signs of wear or damage, specifically anything resembling {subfolder_string}?"],
    ["Based on the image <image> provided, does the {product} exhibit any physical defects or anomalies, particularly anything akin to {subfolder_string}?"],
    ["Can you detect any apparent flaws or imperfections, such as {subfolder_string}, on the {product} as it appears in the image <image>?"],
    ["Upon examining the image <image>, would you say that the {product} shows any signs of faults or deterioration, especially anything similar to {subfolder_string}?"],
    ["Does the {product}, as seen in the image <image>, display any defects or damages that could be classified as {subfolder_string}?"],
    ["Are there any visible indicators of poor craftsmanship or defects, like {subfolder_string}, on the {product} as showcased in the image <image>?"],
    ["In the provided image <image>, does this {product} show any signs of failing quality or specific defects such as {subfolder_string}?"],
    ["Upon close inspection of the image <image>, are there any noticeable defects or quality issues in the {product}, particularly something that resembles {subfolder_string}?"]
    ],
    "answers_ng":[
    ["Yes. The {product} definitely shows {defect}."],
    ["Yes. A clear indication of {defect} on this {product} suggests it's defective."],
    ["Yes. Signs of {defect} are evident in the {product}, indicating a problem."],
    ["Yes. This {product} has {defect}, a clear defect."],
    ["Yes. Unmistakably, the {product} shows {defect}, pointing to a defect."],
    ["Yes. {defect} in the {product} is obvious, indicating a significant defect."],
    ["Yes. Considering the {product}, the presence of {defect} suggests it's not in perfect condition."],
    ["Yes. {defect} is noticeable on the {product}, indicating it's not as it should be."],
    ["Yes. With {defect} present, this {product} certainly seems defective."],
    ["Yes. {defect} on this {product} clearly points to a problem."],
    ["Yes. Upon a thorough examination of the {product}, it is quite apparent that there are significant signs of {defect}. This observation is critical as it strongly suggests that the product has a manufacturing or usage defect, which could potentially impact its functionality or aesthetic appeal."],
    ["Yes. After carefully analyzing the {product}, it's clear that there are unmistakable indications of {defect}. This is a cause for concern as it not only affects the integrity of the product but also raises questions about its longevity and reliability in the long term."],
    ["Yes. The presence of {defect} on this particular {product} is undeniable. This kind of flaw is not just superficial but could potentially signify deeper issues within the product, affecting its overall performance and customer satisfaction."],
    ["Yes. The {product} in question undeniably shows signs of {defect}. This finding is significant because it not only diminishes the product's aesthetic value but also suggests a compromise in the quality control processes of its manufacturing."],
    ["Yes. After an in-depth review, it's evident that the {product} exhibits {defect}. This is particularly concerning as it may indicate a lapse in the manufacturing standards or possibly mishandling during shipping or storage."],
    ["Yes. The {product} clearly displays {defect}, which is a red flag for potential buyers. Such defects are not just minor issues but could lead to further complications, possibly affecting the product's usability and customer satisfaction."],
    ["Yes. There is a noticeable presence of {defect} on the {product}, which is alarming. This type of defect could have various implications, ranging from aesthetic damage to potential functional impairments, depending on the severity and nature of the flaw."],
    ["Yes. This {product} unmistakably shows signs of {defect}, which is a significant concern. Defects of this nature are often indicative of deeper problems and could hint at a broader issue with the product line or brand quality."],
    ["Yes. After a detailed inspection, the {product} has visible {defect}, and this cannot be overlooked. Such defects raise serious questions about the product's durability and the reliability of the manufacturer's quality assurance processes."],
    ["Yes. It's unmistakably clear that the {product} has {defect}. This finding is critical as it not only impacts the immediate usability of the product but also raises concerns about its long-term durability and the trustworthiness of the brand."],
    ["Yes. The image clearly shows the {product} exhibiting signs of {defect}, which is a definitive indication of a manufacturing defect or damage during handling."],
    ["Yes. Upon inspecting the image, it's evident that the {product} has visible wear, notably in the form of {defect}, which indicates a decline in its overall condition and quality."],
    ["Yes. The image reveals that the {product} has apparent flaws, specifically {defect}, which raises concerns about its integrity and long-term usability."],
    ["Yes. In the image, the {product} clearly displays defects or damages that align with {defect}, pointing towards quality issues or potential mishandling."],
    ["Yes. The provided image shows the {product} exhibiting signs of failing quality, particularly defects akin to {defect}, which is a cause for concern regarding its overall reliability."],
    ["Yes. The detailed analysis of the image reveals that the {product} indeed exhibits {defect}. This is not just a superficial issue but a significant concern that could impact the product's functionality and longevity, demanding immediate attention and potential rectification measures."],
    ["Yes. It's unmistakably apparent from the image that the {product} suffers from a {defect}, which is a clear indication of either a manufacturing flaw or damage incurred during transportation. Such defects not only compromise the aesthetic appeal of the product but also raise questions about its overall structural integrity."],
    ["Yes. Upon close examination of the image, the presence of {defect} on the {product} is quite evident. This not only detracts from the product's visual appeal but also indicates potential underlying issues that could affect its performance and durability."],
    ["Yes. The {product}, as depicted in the image, unmistakably shows signs of {defect}. This flaw is not to be taken lightly as it could significantly impair the product's usability and consumer satisfaction, necessitating a thorough investigation into its cause."],
    ["Yes. The analysis of the image indicates that the {product} is afflicted with {defect}. This sort of defect is particularly troubling as it not only affects the immediate functionality of the product but also casts doubt on its reliability and the manufacturer's reputation."]
    ],

    "answers_ok" : [
    ["No. This {product} seems fine."],
    ["No. No visible faults like {subfolder_string} on the {product}."],
    ["No. {product} appears free of issues such as {subfolder_string}."],
    ["No. No {subfolder_string} faults detected on the {product}."],
    ["No. After checking, the {product} seems clear of {subfolder_string} issues."],
    ["No. {product} lacks any visible {subfolder_string} faults, indicating good condition."],
    ["No. Nothing like {subfolder_string} found on this {product}."],
    ["No. {product} looks good, no {subfolder_string} defects seen."],
    ["No. {product} appears non-defective, lacking {subfolder_string} type faults."],
    ["No. This {product} displays no {subfolder_string} issues, suggesting it's in prime condition."],
    ["No. After a comprehensive examination of the {product}, it appears to be free of any visible faults like {subfolder_string}. This observation is significant as it speaks volumes about the product's quality and the rigorous standards employed in its manufacturing process, ensuring that it is in a non-defective, pristine condition."],
    ["No. The {product} does not show any signs of faults such as {subfolder_string}. This is a testament to the high-quality materials and craftsmanship that have gone into its creation, ensuring that the product not only meets but exceeds the expectations of durability and aesthetic appeal."],
    ["No. Upon detailed scrutiny, there are no indications of faults like {subfolder_string} on the {product}. This finding is important as it suggests that the product has been manufactured with precision and care, maintaining a high standard of quality control."],
    ["No. The {product} seems to be in impeccable condition, displaying no visible faults like {subfolder_string}. This is reassuring as it indicates that the product has been handled and stored with utmost care, preserving its quality and integrity."],
    ["No. After a thorough inspection, the {product} does not exhibit any faults such as {subfolder_string}. This is a clear indicator of the product's superior quality and the meticulous attention to detail that has gone into its manufacturing process."],
    ["No. There are no visible signs of any faults like {subfolder_string} on the {product}, suggesting it has been crafted to perfection. This lack of defects is a strong indication of the product's robustness and the stringent quality checks it has undergone."],
    ["No. The {product} is devoid of any visible faults, including those like {subfolder_string}. This is a significant point, as it not only demonstrates the product's aesthetic perfection but also its functional reliability, which is a crucial aspect for consumer satisfaction."],
    ["No. Upon careful observation, the {product} displays no faults of the {subfolder_string} kind. This suggests that the product has passed through rigorous quality assessments, ensuring that it is in top-notch condition for the end-user."],
    ["No. The {product} is in a non-defective state, showing no signs of faults such as {subfolder_string}. This lack of defects is commendable and reflects the high standards of quality and care taken in the product's design and manufacturing process."],
    ["No. There are no discernible faults like {subfolder_string} on the {product}, which is a clear indicator of its exceptional quality. This flawless condition underscores the manufacturer's commitment to delivering a product that is not only visually appealing but also structurally sound and reliable."],
    ["No. The {product} in the image appears to be free of any significant faults like {subfolder_string}, suggesting that it is in an excellent, non-defective condition."],
    ["No. The careful observation of the image confirms that the {product} remains in a faultless state, showing no traces of {subfolder_string} or similar defects. This lack of flaws is commendable and suggests that the product has been produced and handled with the utmost care, ensuring it meets the highest standards of quality."],
    ["No. After a comprehensive evaluation of the image, it is evident that the {product} is in excellent condition, free from any defects such as {subfolder_string}. This finding underlines the product's robust build quality and the stringent quality assurance processes it has undergone."],
    ["No. The detailed scrutiny of the image reveals that the {product} is in a remarkably non-defective condition, showing no signs of faults like {subfolder_string}. This is indicative of a well-made product, reflecting the high-quality materials and skilled workmanship that have gone into its creation."],
    ["No. The thorough inspection of the image suggests that the {product} is devoid of any visible faults, especially those resembling {subfolder_string}. This outcome highlights the meticulous attention to detail and the high standards of craftsmanship that went into the making of this product, ensuring its pristine condition."],
    ["No. After meticulously examining the image, it becomes clear that the {product} does not display any faults like {subfolder_string}. This absence of defects is a testament to the exceptional quality control measures adopted during its production, ensuring that the product is in an impeccable and non-defective state."],
    ["No. Upon close inspection of the image, the {product} appears devoid of any noticeable defects or quality issues, especially those resembling {subfolder_string}, ensuring its superior quality and craftsmanship."],
    ["No. There are no visible indicators of poor craftsmanship or defects like {subfolder_string} on the {product} in the image, which speaks to its high-quality construction and finish."],
    ["No. The {product}, as observed in the image, shows no signs of faults or deterioration that could be compared to {subfolder_string}, signifying it remains in a pristine state."],
    ["No. After a thorough review of the image, the {product} does not display any physical defects or anomalies resembling {subfolder_string}, indicating it is in prime condition."]
    ]
}